Revit 2024 API
KeyBasedTreeEntries.GetKeyBasedTreeEntriesIterator Method
 Returns a KeyBasedTreeEntriesIterator that iterates through the collection.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2015
Syntax
C#
public KeyBasedTreeEntriesIterator GetKeyBasedTreeEntriesIterator()
Visual Basic
Public Function GetKeyBasedTreeEntriesIterator As KeyBasedTreeEntriesIterator
Visual C++
public:
KeyBasedTreeEntriesIterator^ GetKeyBasedTreeEntriesIterator()
Return Value
 A KeyBasedTreeEntriesIterator object that can be used to iterate through KeyBasedTreeEntry objects in the collection.
See Also
KeyBasedTreeEntries Class
Autodesk.Revit.DB Namespace